<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"4b9e9e84a8a37c251422dbee29a3610a8de420bc40809b1baf86289244dfae6c","plan_job_ref":"Job Terraform plan #13 at https://github.com/mkuthan/stream-processing/actions/runs/6623253384","plan_hash":"e289ad76b5a653df2d64a0d7ffd20809f343ed6b17a649097cfb5dcdccc690d3","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan in __toll-infrastructure__
<details>
<summary>Plan: 1 to add, 15 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_bigquery_table.io-diagnostic-table will be updated in-place
  ~ resource "google_bigquery_table" "io-diagnostic-table" {
        id                       = "projects/playground-272019/datasets/toll_application/tables/io-diagnostic"
      + require_partition_filter = true
        # (18 unchanged attributes hidden)

      ~ time_partitioning {
          - require_partition_filter = true -> null
            # (3 unchanged attributes hidden)
        }
    }

  # google_bigquery_table.toll-booth-entry-stats-daily-table will be updated in-place
  ~ resource "google_bigquery_table" "toll-booth-entry-stats-daily-table" {
        id                       = "projects/playground-272019/datasets/toll_application/tables/toll-booth-entry-stats-daily"
      + require_partition_filter = true
        # (18 unchanged attributes hidden)

      ~ time_partitioning {
          - require_partition_filter = true -> null
            # (3 unchanged attributes hidden)
        }
    }

  # google_bigquery_table.toll-booth-entry-stats-hourly-table will be updated in-place
  ~ resource "google_bigquery_table" "toll-booth-entry-stats-hourly-table" {
        id                       = "projects/playground-272019/datasets/toll_application/tables/toll-booth-entry-stats-hourly"
      + require_partition_filter = true
        # (18 unchanged attributes hidden)

      ~ time_partitioning {
          - require_partition_filter = true -> null
            # (3 unchanged attributes hidden)
        }
    }

  # google_bigquery_table.toll-booth-entry-stats-table will be updated in-place
  ~ resource "google_bigquery_table" "toll-booth-entry-stats-table" {
        id                       = "projects/playground-272019/datasets/toll_application/tables/toll-booth-entry-stats"
      + require_partition_filter = true
        # (18 unchanged attributes hidden)

      ~ time_partitioning {
          - require_partition_filter = true -> null
            # (3 unchanged attributes hidden)
        }
    }

  # google_bigquery_table.toll-booth-entry-table will be updated in-place
  ~ resource "google_bigquery_table" "toll-booth-entry-table" {
        id                       = "projects/playground-272019/datasets/toll_application/tables/toll-booth-entry"
      + require_partition_filter = true
        # (18 unchanged attributes hidden)

      ~ time_partitioning {
          - require_partition_filter = true -> null
            # (3 unchanged attributes hidden)
        }
    }

  # google_bigquery_table.toll-booth-exit-table will be updated in-place
  ~ resource "google_bigquery_table" "toll-booth-exit-table" {
        id                       = "projects/playground-272019/datasets/toll_application/tables/toll-booth-exit"
      + require_partition_filter = true
        # (18 unchanged attributes hidden)

      ~ time_partitioning {
          - require_partition_filter = true -> null
            # (3 unchanged attributes hidden)
        }
    }

  # google_bigquery_table.total-vehicle-times-diagnostic-table will be updated in-place
  ~ resource "google_bigquery_table" "total-vehicle-times-diagnostic-table" {
        id                       = "projects/playground-272019/datasets/toll_application/tables/total-vehicle-times-diagnostic"
      + require_partition_filter = true
        # (18 unchanged attributes hidden)

      ~ time_partitioning {
          - require_partition_filter = true -> null
            # (3 unchanged attributes hidden)
        }
    }

  # google_bigquery_table.total-vehicle-times-one-hour-gap-diagnostic-table will be updated in-place
  ~ resource "google_bigquery_table" "total-vehicle-times-one-hour-gap-diagnostic-table" {
        id                       = "projects/playground-272019/datasets/toll_application/tables/total-vehicle-times-one-hour-gap-diagnostic"
      + require_partition_filter = true
        # (18 unchanged attributes hidden)

      ~ time_partitioning {
          - require_partition_filter = true -> null
            # (3 unchanged attributes hidden)
        }
    }

  # google_bigquery_table.total-vehicle-times-one-hour-gap-table will be updated in-place
  ~ resource "google_bigquery_table" "total-vehicle-times-one-hour-gap-table" {
        id                       = "projects/playground-272019/datasets/toll_application/tables/total-vehicle-times-one-hour-gap"
      + require_partition_filter = true
        # (18 unchanged attributes hidden)

      ~ time_partitioning {
          - require_partition_filter = true -> null
            # (3 unchanged attributes hidden)
        }
    }

  # google_bigquery_table.total-vehicle-times-table will be updated in-place
  ~ resource "google_bigquery_table" "total-vehicle-times-table" {
        id                       = "projects/playground-272019/datasets/toll_application/tables/total-vehicle-times"
      + require_partition_filter = true
        # (18 unchanged attributes hidden)

      ~ time_partitioning {
          - require_partition_filter = true -> null
            # (3 unchanged attributes hidden)
        }
    }

  # google_bigquery_table.vehicle-registration-table will be updated in-place
  ~ resource "google_bigquery_table" "vehicle-registration-table" {
        id                       = "projects/playground-272019/datasets/toll_application/tables/vehicle-registration"
      + require_partition_filter = true
        # (18 unchanged attributes hidden)

      ~ time_partitioning {
          - require_partition_filter = true -> null
            # (2 unchanged attributes hidden)
        }
    }

  # google_bigquery_table.vehicles-with-expired-registration-daily-diagnostic-table will be updated in-place
  ~ resource "google_bigquery_table" "vehicles-with-expired-registration-daily-diagnostic-table" {
        id                       = "projects/playground-272019/datasets/toll_application/tables/vehicles-with-expired-registration-daily-diagnostic"
      + require_partition_filter = true
        # (18 unchanged attributes hidden)

      ~ time_partitioning {
          - require_partition_filter = true -> null
            # (3 unchanged attributes hidden)
        }
    }

  # google_bigquery_table.vehicles-with-expired-registration-daily-table will be updated in-place
  ~ resource "google_bigquery_table" "vehicles-with-expired-registration-daily-table" {
        id                       = "projects/playground-272019/datasets/toll_application/tables/vehicles-with-expired-registration-daily"
      + require_partition_filter = true
        # (18 unchanged attributes hidden)

      ~ time_partitioning {
          - require_partition_filter = true -> null
            # (3 unchanged attributes hidden)
        }
    }

  # google_bigquery_table.vehicles-with-expired-registration-diagnostic-table will be updated in-place
  ~ resource "google_bigquery_table" "vehicles-with-expired-registration-diagnostic-table" {
        id                       = "projects/playground-272019/datasets/toll_application/tables/vehicles-with-expired-registration-diagnostic"
      + require_partition_filter = true
        # (18 unchanged attributes hidden)

      ~ time_partitioning {
          - require_partition_filter = true -> null
            # (3 unchanged attributes hidden)
        }
    }

  # google_bigquery_table.vehicles-with-expired-registration-table will be created
  + resource "google_bigquery_table" "vehicles-with-expired-registration-table" {
      + creation_time            = (known after apply)
      + dataset_id               = "****************"
      + deletion_protection      = false
      + effective_labels         = (known after apply)
      + etag                     = (known after apply)
      + expiration_time          = (known after apply)
      + id                       = (known after apply)
      + last_modified_time       = (known after apply)
      + location                 = (known after apply)
      + num_bytes                = (known after apply)
      + num_long_term_bytes      = (known after apply)
      + num_rows                 = (known after apply)
      + project                  = "playground-272019"
      + require_partition_filter = true
      + schema                   = jsonencode(
            [
              + {
                  + name = "created_at"
                  + type = "TIMESTAMP"
                },
              + {
                  + name = "vehicle_registration_id"
                  + type = "STRING"
                },
              + {
                  + name = "toll_booth_id"
                  + type = "STRING"
                },
              + {
                  + name = "entry_time"
                  + type = "TIMESTAMP"
                },
              + {
                  + name = "license_plate"
                  + type = "STRING"
                },
            ]
        )
      + self_link                = (known after apply)
      + table_id                 = "**********************************"
      + terraform_labels         = (known after apply)
      + type                     = (known after apply)

      + time_partitioning {
          + expiration_ms = (known after apply)
          + field         = "created_at"
          + type          = "DAY"
        }
    }

  # google_storage_bucket.toll-application-bucket will be updated in-place
  ~ resource "google_storage_bucket" "toll-application-bucket" {
      ~ force_destroy               = false -> true
        id                          = "playground-272019-toll-application"
        name                        = "playground-272019-toll-application"
        # (12 unchanged attributes hidden)

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }
          + condition {
              + age                   = 30
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = (known after apply)
            }
        }
    }

Plan: 1 to add, 15 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan #13](https://github.com/mkuthan/stream-processing/actions/runs/6623253384)